# SetVPLayerVisibility

## Description
Sets the visibility for the specified layer in the specified viewport.

```pascal
FUNCTION SetVPLayerVisibility(
				viewportHandle : HANDLE;
				layerHandle    : HANDLE;
				visibilityType : INTEGER) : BOOLEAN;
```

```python

def vs.SetVPLayerVisibility(viewportHandle, layerHandle, visibilityType):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|viewportHandle|HANDLE||
|layerHandle|HANDLE||
|visibilityType|INTEGER||

## Version
Availability: from VectorWorks11.0
## Category
* Objects - Groups